<?php
	//Устанавливаем настройки памяти
	echo "memory_limit ", ini_get('memory_limit'), "<br />";
	ini_set('memory_limit', '1024M');	
	echo "memory_limit ", ini_get('memory_limit'), "<br />";

	//Устанавливаем настройки времени
	echo "max_execution_time ", ini_get('max_execution_time'), "<br />";
	ini_set('max_execution_time', 600000);
	// set_time_limit(6000);// одно и тоже что ini_set('max_execution_time', 600);
	echo "max_execution_time ", ini_get('max_execution_time'), "<br />";

	//Устанавливаем настройки загружаемого файла
	// echo "upload_max_filesize ", ini_get('upload_max_filesize'), "<br />";
	// ini_set("upload_max_filesize","100M");
	// echo "upload_max_filesize ", ini_get('upload_max_filesize'), "<br />";

	echo "post_max_size ", ini_get('post_max_size'), "<br />";
	echo "set_time_limit ", ini_get('set_time_limit'), "<br />";

	// ob_implicit_flush(1);
	ob_end_flush();	
	// ob_start();

	$Products = new Products();
	$Parser = new Parser();




	//****************************************************************************************************
	//Обновление названия товаров в программе
		//Открываем файл списка нужных товаров
		// $fail = $GLOBALS['PATH_post_img'].'ObTov.txt';
		// if (!$ObTov = fread(fopen($fail, "r"), filesize($fail))){
		// 	echo "Не удалось открыть файл<br/>";
		// 	die();
		// }
		// $result = array_unique(explode(",", $ObTov));
		// echo count($result), '<br/>';
		// foreach ($result as $key => $value) {
		// 	if ($Product = $Products->GetIdnameArrayByArt(trim($value))) {
		// 		echo "UPDATE tblMain SET SiteIdProduct = ".$Product['id_product']. ", Product = '".$Product['name']. "' WHERE ProductCode = ".$value.';', '<br/>';
		// 	}
		// }
	// die();
	//****************************************************************************************************
	//удаление товаров по выборке
		//выборка с базы---------------------------------------------------
		// $sgl0 = "SELECT p.id_product FROM c1kharkovt_bd4.xt_product as p  where p.id_product not IN (SELECT id_product FROM xt_assortiment LEFT JOIN xt_user ON xt_user.id_user = xt_assortiment.id_supplier WHERE xt_user.active + xt_assortiment.active = 2) and p.id_product not in (select id_product FROM c1kharkovt_bd4.xt_assortiment where id_supplier in (95,9414,93,9244,9209,89,8833,8709,87,86,82,8123,8,75,73,7068,6928,64,6261,619,61,600,596,55,53,5059,4725,4722,4710,4655,4654,4636,43,42,384,3793,3683,36072,35519,35489,3520,3506,3361,3223,32076,31536,30115,2652,2479,24,22252,22250,220,21767,21763,21396,21394,21,20439,20302,20297,20292,20289,19810,19803,19797,18514,18512,18509,18508,18,17835,16531,16526,16522,16520,16516,15610,14291,13552,13315,13180,13,12869,12863,128,12411,12401,12396,12250,1218,11531,115,112,102,101,4710,73,75,82,83,86,87,89,92,93,95,96,101,102,596,1700,31,2430,2479,3223,3402,3506,13,3520,3793,4639,4654,4722,112,113,115,116,174,220,10,2652,18,12,3593,128,21,24,26,4725,5059,384,619,821,1231,3361,3683,4492,43,45,47,53,55,60,61,600,1218,4636,277,2160,6261,6928,7068,7355,8123,8709,9146,9160,9209,9244,9245,9414,4655,8833,11498,11531,8,12250,12376,12396,12398,12401,12411,12863,12865,12869,12871,13315,13552,14291,14294,14295,14300,14303,15602,15610,16516,16518,16520,16522,16524,16526,16527,16531,17833,17835,18508,18509,18512,18514,18522,19283,19284,19797,19803,19810,19812,20289,20292,20297,20300,20302,20439,21394,21396,21413,21754,21763,21764,21767,21769,22240,22243,22246,22250,22252,30115,31536,32115,32076,35489))";	
		// $sgl0 = "SELECT id_product FROM c1kharkovt_bd4.xt_assortiment where id_supplier = 18512 and id_product > 334497 ";

		// $del = $Parser->get_db($sgl0);

		//Открываем файл удаление товаров по списку ---------------------------------------------------
		// $fail = $GLOBALS['PATH_post_img'].'del_ID.txt';
		// if (!$del = fread(fopen($fail, "r"), filesize($fail))){
		// 	echo "Не удалось открыть файл<br />";
		// 	die();
		// }
		// $del = array_unique(explode(";", $del));

		//задаем массив----------------------------------------------------
		$del = array(345971,345972,345973,345974,345975,345976,345981,345982,345983,345987,345988,345991,345992,345993,345994,345995,345996,345997,345998,346000,346001,346002,346003,346004,346005,346006,346007,346008,346009,346010,346011,346012,346014,346020,346022,345965,345966,345967,346023,346024,346032,346034,346035,346036,346037,346038,346039,346045,346046,346047,346048,346049,346050,346051,346052,346053,346054,346055,346056,346057,346058,346059,346060,346061,346062,346063,346064,346065,346066,346067,346068,346069,346070,346071,346072,346073,346074,346075,346076,346077,346078,346079,346080,346081,346082,346083,346084,345984,346087,346088,346089,346091,346092,346093,346094,346095,346096,346097,346098,346099,346100,346101,346102,346103,346104,346105,346106,346107,346108,346109,346110,346111,346112,346113,346114,346115,346116,346117,346118,346119,346120,346121,346122,346123,346124,346125,346126,346127,346128,346129,346130,346131,346132,346133,346134,346135,346136,346137,346138,346139,346140,346141,346142,346143,346144,345985,346147,346148,346149,345930,346150,345931,346151,346152,346153,346154,346155,346156,346157,346158,346159,346160,346161,346162,346163,346164,346165,346166,346167,346170,346171,346172,346173,346174,346175,346176,346177,346178,346179,346180,346181,346184,346185,346186,346187,346188,346189,346190,346191,346027,346192,346193,346028,346194,346195,346196,346030,346197,346031,346033,346198,346199,346200,346201,346202,346203,346204,346205,346206,346207,346208,346209,346210,346211,346212,346213,346214,346215,346216,346217,346218,346219,346220,346221,346222,346223,346224,346225,346226,346227,346040,346228,346025,346041,346230,346231,346042,346232,346233,346234,346235,346236,346237,346238,346239,346240,346242,346243,346244,346245,346246,346247,346248,346249,346250,346251,346252,346253,346254,346255,346256,346257,346258,346259,346260,346261,346262,345980,346263,346264,345986,346266,346265,346267,346268,345989,345990,346269,346270,346271,346272,346273,346274,346275,346276,346277,346278,346279,346280,346282,346283,346281,346284,346285,346286,346287,346288,345999,346289,346290,346291,346292,346293,346294,346295,346296,346297,346013,346017,346302,346085,346303,346304,346305,346306,346307,346308,346309,346310,346086,346311,346312,346313,346314,346315,346316,346317,346318,346319,346320,346321,346322,346323,346019,346021,346241,346324,346325,346326,346327,346328,346329,346330,346331,346332,346333,346334,346337,346338,346339,346340,346341,346342,346343,346344,346345,346346,346347,346348,345910,345911,345915,345969,345970,345913,345914,345916,345919,346145,346146,345921,345927,345926,345929,346349,346350,346168,346169,346353,346354,346029,346355,346043,346044,346356,346357,346358,346359,346360,346361,346362,346363,346364,346365,346366,346367,346368,346369,346370,346371,346372,346373,346374,346375,346376,346377,346378,346379,346380,346381,346382,346383,346384,346385,346386,346387,346388,346389,346390,346391,346392,346393,346394,346395,346396,346397,346398,346399,346400,346401,346402,346403,346404,346405,346406,346407,346408,346409,346410,346411,346412,346413,346414,346415,346416,346417,346418,346419,346420,346421,346422,346423,346424,346425,346426,346427,346428,346429,346430,346431,346432,346433,346434,346435,346436,346437,346438,346439,346440,346441,346442,346443,346444,346445,346446,346447,346448,346449,346450,346451,346452,346453,346454,346455,346456,346457,346458,346459,346460,346461,346462,346463,346464,346465,346466,346467,346468,346469,346470,346471,346472,346473,346474,346475,346476,346477,346478,346479,346480,346481,346482,346483,346484,346485,346486,346487,346488,346489,346490,346491,346492,346493,346494,346495,346496,346497,346498,346499,346500,346501,346502,346503,346504,346505,346506,346507,346508,346509,346510,346511,346512,346513,346514,346515,346516,346517,346518,346519,346520,346521,346522,346523,346524,346525,346526,346527,346528,346529,346530,346531,346532,346533,346534,346535,346536,346537,346538,346539,346540,346541,346542,346543,346544,346545,346546,346547,346548,346549,346550,346551,346552,346553,346554,346555,346556,346557,346558,346559,346560,346561,346562,346563,346564,346565,346566,346567,346568,346569,346570,346571,346572,346573,346574,346575,346576,346577,346578,346579,346580,346581,346090,346582,346583,346584,346585,346586,346587,346588,346589,346590,346591,346592,346593,346594,346595,346596,346597,346598,346599,346600,346601,346602,346603,346604,346605,346606,346607,346608,346609,346610,346611,346612,346613,346614,346615,346616,346617,346229,346618,346026,346619,346620,346621,346622,346623,346624,346625,346626,346627,346628,346351,346629,346630,346631,346352,346632,346633,346634,346635,346636,346637,346638,346639,346640,346641,346642,346643,346644,346645,346646,346647,346648,346649,346650,346651,346652,346653,346654,346655,346656,346657,346658,346659,346660,346661,346662,346663,346664,346665,346666,346667,346668,346669,346670,346671,346672,346673,346674,346675,346676,346677,346678,346679,346336,346335,346680,346681,346682,346683,346684,346685,346686,346687,346688,346689,346690,346691,346692,346693,346694,346695,346696,346697,346698,346699,346700,346701,346702,346703,346704,346705,346706,346707,346708,346709,346710,346711,346712,346713,346714,346715,346716,346717,346718,346719,346720,345920,346721,346722,346723,346724,346725,346726,346727,346731,346732,346733,346735,346737,346738,346740,346741,346743,346744,346745,346728,346729,346730,346746,346734,346739,345977,345978,345979,346742,345932,345942,345951,345961,345963,345964,346182,346183,346750,346751,346752,346753,346754,346755,346756,346757,346758,346759,346760,346761);		
		
		echo count($del), '<br/>';
		// die('СТОП');
		foreach ($del as $key => $value) {
			$Products->DelProduct($value);
			echo $value, " Удален<br/>";
		}
		die('СТОП');
	//****************************************************************************************************
	//выбераем список нужных фото с старой формы базы
	$PATH_pro2 = '/var/www/clients/client1/web1/web';
	$PATH_original = '/var/www/clients/client1/web1/web/efiles/image/';
	$PATH_thumb = '/var/www/clients/client1/web1/web/efiles/_thumb/image/';
	$PATH_500 = '/var/www/clients/client1/web1/web/efiles/image/500/';

	$PATH_prod = '/var/www/xt.ua/web';
	$poduct_images_original = '/product_images/original/';
	$product_images_medium = '/product_images/medium/';
	$product_images_thumb = '/product_images/thumb/';
	
	$sgl = "SELECT images, img_1, img_2, img_3 FROM c1kharkovt_bd4.xt_product where images <> ''";
	$array = $Parser->get_db($sgl);
	$array2 = array();
	foreach ($array as $key => $value) {
		$array2[] = $value['images'];
		$array2[] = $value['img_1'];
		$array2[] = $value['img_2'];
		$array2[] = $value['img_3'];
	}
	$array2 = array_unique($array2);
	echo 'В таблице product сылок на картинку', count($array2), "<br/>";

	$array_img2 = array();
	foreach ($array2 as $key => $value) {	
		if (!strstr($value, 'original') && $value != '') {
			echo "<br/>";
			echo $PATH = $PATH_pro2.$value, "<br/>";
			$array_img2[] = $PATH;
			echo $img = str_replace($PATH_original, $PATH_thumb, $PATH), "<br/>";
			$array_img2[] = $img;
			echo $img = str_replace($PATH_original, $PATH_500, $PATH), "<br/>";
			$array_img2[] = $img;
			
		}
		if (strstr($value, 'original')) {
			echo $PATH_prod.$value, "<br/>";
			$array_img2[] = $PATH_prod.$value;
			echo $img = str_replace($poduct_images_original, $product_images_medium, $PATH_prod.$value), "<br/>";
			$array_img2[] = $img;
			echo $img = str_replace($poduct_images_original, $product_images_thumb, $PATH_prod.$value), "<br/>";
			$array_img2[] = $img;	
		}
	}
	echo 'Оставить фото список 1 ', count($array_img2), "<br/>";
	// die();

	//Проходи по каталогу и выбераем имена фото проверяем на нужность и УДАЛЯЕМ ненужные
 	$s2 = $n2 = 0; 	
 	$PATH_efiles = '/var/www/clients/client1/web1/web/efiles';
	$objects2 = new RecursiveIteratorIterator(new RecursiveDirectoryIterator($PATH_efiles), RecursiveIteratorIterator::SELF_FIRST);
	foreach($objects2 as $name => $object){
		if(!is_dir($name) && !in_array($name, $array_img2)){
				echo $name, " Удаление ", $n2++, " <br/>";				
				unlink($name);	//удаляем фото		
			}else{
				echo  $name, " ОК ", $s++,"<br/>";
			}
	}
	echo 'Удалили фото', count($n2), "*****************************************************************<br/>";
	echo 'Осталось фото', count($s2), "*****************************************************************<br/>";


	//выбераем список нужных фото с базы	
	$sgl = 'SELECT * FROM c1kharkovt_bd4.xt_image';
	$array_image = $Parser->get_db($sgl);
	echo 'В таблице записей: ',count($array_image), "<br/>";

	$array_img = array();
	foreach ($array_image as $key => $value) {
		echo "<br/>";
		echo $PATH_prod.$value['src'], "<br/>";
		$array_img[] = $PATH_prod.$value['src'];
		echo $img = str_replace($poduct_images_original, $product_images_medium, $PATH_prod.$value['src']), "<br/>";
		$array_img[] = $img;
		echo $img = str_replace($poduct_images_original, $product_images_thumb, $PATH_prod.$value['src']), "<br/>";
		$array_img[] = $img;		
	}
	echo 'Оставить фото список 2', count($array_img), "<br/>";

	//Проходим по каталогу /var/www/xt.ua/web/product_images' и выбераем имена фото
 	$s = $n = 0; 	
 	$PATH_product_images = '/var/www/xt.ua/web/product_images';	
	$objects = new RecursiveIteratorIterator(new RecursiveDirectoryIterator($PATH_product_images), RecursiveIteratorIterator::SELF_FIRST);
	foreach($objects as $name => $object){		
			if(!is_dir($name) && !in_array($name, $array_img)){
				echo $name, " Удаление ->->->", $n++, " <br/>";
				unlink($name);//удаляем фото->->->
			}else{
				echo  $name, is_dir($name)?' каталог ':'', " ОК ", $s++,"<br/>";
			}
	}
	echo 'Удалили фото', count($n), "*****************************************************************<br/>";
	echo 'Осталось фото', count($s), "*****************************************************************<br/>";	
	// die();
		

	//****************************************************************************************************
	//ВОЗВРАТ НУЖНЫХ ФОТО С БЕКАПА
	//****************************************************************************************************
	// //выбераем список нужных фото
	// $sgl = 'SELECT * FROM c1kharkovt_bd4.xt_image where id_product IN (SELECT distinct id_product FROM xt_assortiment LEFT JOIN xt_user ON xt_user.id_user = xt_assortiment.id_supplier WHERE xt_user.active + xt_assortiment.active = 2)';
	// $array_image = $Parser->get_db($sgl);
	// echo 'В таблице записей',count($array_image), "<br/>";
	// $not_foto = $array_img = array();
	// foreach ($array_image as $key => $value) {				
	// 	if (file_exists($PATH_prod.$value['src'])) {
	// 		// echo $PATH_prod.$value['src'], ' ->';
	// 	    // echo " Есть файл", '<br/>';
	// 	} else {			
	// 		$not_foto[] = $value;
	// 		echo $PATH_prod.$value['src'], ' ->';
	// 	    echo " НЕТ файла ", $value['id_product'], '<br/>';
	// 	}
	// }
	// echo 'нет фото ', count($not_foto);

	// //****************************************************************************************************
	// //выбераем список нужных фото

	// $prod = 'E:/xt/mainstor/rdiff-backup/vm2818_restore/var/www/clients/client1/web1/web';
	// $prod_500 = 'E:/xt/mainstor/rdiff-backup/vm2818_restore/var/www/clients/client1/web1/web';
	// $prod_250 = 'E:/xt/mainstor/rdiff-backup/vm2818_restore/var/www/clients/client1/web1/web';
	// // E:\xt\mainstor\rdiff-backup\vm2818_restore\var\www\clients\client1\web1\web\efiles\image\250\
	// // /efiles/image/17742-5.jpg

	// $sgl = 'SELECT id_product, images, img_1, img_2, img_3 FROM c1kharkovt_bd4.xt_product where id_product IN (SELECT distinct id_product FROM xt_assortiment LEFT JOIN xt_user ON xt_user.id_user = xt_assortiment.id_supplier WHERE xt_user.active + xt_assortiment.active = 2)';
	// $array_image = $Parser->get_db($sgl);
	// // echo 'В таблице записей',count($array_image), "<br/>";
	// // $array_img = array();
	// foreach ($array_image as $key => $value) {
	// 	if ($value['images'] != '' && !file_exists($prod.$value['images']) && !strstr($prod.$value['images'], 'original')) {
	// 		$not_foto[] = $value;
	// 		echo $prod.$value['images'], " НЕТ images ", $value['id_product'], '<br/>';
	// 	}else{
	// 		echo $prod.$value['images'], " ЕСТЬ images ", $value['id_product'], '<br/>';
	// 	}
	// 	if ($value['img_1'] != '' && !file_exists($prod.$value['img_1']) && !strstr($prod.$value['img_1'], 'original')) {
	// 		$not_foto[] = $value;
	// 		echo $prod.$value['img_1'], " НЕТ img_1 ", $value['id_product'], '<br/>';
	// 	}else{
	// 		echo $prod.$value['img_1'], " ЕСТЬ img_1 ", $value['id_product'], '<br/>';
	// 	}
	// 	if ($value['img_2'] != '' && !file_exists($prod.$value['img_2']) && !strstr($prod.$value['img_2'], 'original')) {
	// 		$not_foto[] = $value;
	// 		echo $prod.$value['img_2'], " НЕТ img_2 ", $value['id_product'], '<br/>';
	// 	}else{
	// 		echo $prod.$value['img_2'], " ЕСТЬ img_2 ", $value['id_product'], '<br/>';
	// 	}
	// 	if ($value['img_3'] != '' && !file_exists($prod.$value['img_3']) && !strstr($prod.$value['img_3'], 'original')) {
	// 		$not_foto[] = $value;
	// 		echo $prod.$value['img_3'], " НЕТ  img_3 ", $value['id_product'], '<br/>';
	// 	}else{
	// 		echo $prod.$value['img_3'], " НЕТ  img_3 ", $value['id_product'], '<br/>';
	// 	}
	// }
	// echo 'Товары нет фото ', count($not_foto);



// phpinfo();
?>